Catalogs/АвтоматическиеСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>АвтоматическиеСкидки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПредоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОграниченияПоНоменклатуре</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОграниченийСкидокПоНоменклатуре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСовместногоПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСовместногоПримененияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьГруппыВУточненииПоНоменклатуре</Name>
					<Comment>(Опт)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОграниченияПоПолучателямКонтрагентам</Name>
					<Comment>По контрагентам (опт) или складам (розница).</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОграниченияПоПолучателямСкладам</Name>
					<Comment>(Розница)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРасписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУсловияПоДК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУточненияПоКатегориям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУточненияПоНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУточненияПоЦеновымГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияАвтоматическихСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьПредоставления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбластейОграниченияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>Порядок округления</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПредоставления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПредоставленияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПравилоНачисленияБонусов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОграниченияПоПолучателямСегментам</Name>
					<Comment>По контрагентам (опт) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУточненияПоСегментамНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОграниченияПоПолучателям</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОграниченийСкидокПоКонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментВыдачиСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТочкиВыдачиСообщенияКассиру</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛюбойПодарокИзСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодарокИзКорзиныПокупателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПодарокКакПродажу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратноКоличествуУсловий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатратПодарка</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУсловияПредъявленПромокод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаНаСледующуюПокупкуПоПромокоду</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоматическиеСкидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУсловияАктивацииВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляРасчетаВРасширении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДаритьТолькоПолныйКомплект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриВозврате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУсловияПоВидуОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УменьшатьНаСуммуОплатыБаллами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КртаностьСкидкиПоУсловию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРежимКратности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВремяПоДнямНедели</Name>
					<Comment>Время действия скидки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Comment>(Общ) Признак выбранного дня недели</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Comment>(Общ) День недели</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Comment>(Общ) Время начала действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Comment>(Общ) Время окончания действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураГруппыЦеновыеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеУточнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияПредоставления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УсловиеПредоставления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УсловияПредоставленияСкидокНаценок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСкидкиКонтрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСкидкиСклады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСкидкиСегменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборПодарков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/НазначенияАвтоматическихСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>НазначенияАвтоматическихСкидок</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Опт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Везде</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/АвтоматическиеСкидки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("Действует");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Если Справочники.АвтоматическиеСкидки.Выбрать().Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Без копеек'");
	Элемент.Действует = Ложь;
	Элемент.СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Округление;
	Элемент.Назначение = Перечисления.НазначенияАвтоматическихСкидок.Везде;
	Элемент.ОбластьПредоставления = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе;
	Элемент.ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре;
	Элемент.ВалютаПредоставления = Справочники.Валюты.ОсновнаяВалютаНачальногоЗаполнения();
	Элемент.ВариантОкругления = Перечисления.ВариантыОкругления.ПоАрифметическимПравилам;
	Элемент.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр1;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

// Заполняет скидку копией настроек скидки-источника, но в сконвертированном формате для подарков из корзины покупателя.
//
// Параметры:
//  СкидкаСтарая - СправочникОбъект.АвтоматическиеСкидки - Скидка-источник
//  СкидкаНовая - СправочникОбъект.АвтоматическиеСкидки - Скидка-примемник, в новом формате
//
Процедура ЗаполнитьСконвертированныеНастройкиПодарокИзКорзиныПокупателя(СкидкаСтарая, СкидкаНовая) Экспорт 
	
	СкидкаНовая.СпособПредоставления = ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.Процент");
	СкидкаНовая.ЗначениеСкидкиНаценки = 100;
	СкидкаНовая.КртаностьСкидкиПоУсловию = 1;
	СкидкаНовая.ИспользоватьРежимКратности = Истина;
	ЕстьУсловияПоСтроке = Справочники.УсловияПредоставленияСкидокНаценок.ЕстьУсловияПоСтроке(СкидкаНовая.УсловияПредоставления.ВыгрузитьКолонку("УсловиеПредоставления"));
	НовоеУсловие = СоздатьУсловиеДляПодаркаНаВыбор(СкидкаСтарая);
	НоваяСтрокаУсловия = СкидкаНовая.УсловияПредоставления.Добавить();
	НоваяСтрокаУсловия.УсловиеПредоставления = НовоеУсловие;
	Если ЕстьУсловияПоСтроке И НЕ СкидкаНовая.ЛюбойПодарокИзСписка Тогда
		СкидкаНовая.ОбластьПредоставления = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке");
	Иначе
		СкидкаНовая.ОбластьПредоставления = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе");
	КонецЕсли;
	Если СкидкаНовая.ДаритьТолькоПолныйКомплект Тогда
		НовоеУсловие = СоздатьУслвоиеЗаКомплект(СкидкаСтарая);
		НоваяСтрокаУсловия = СкидкаНовая.УсловияПредоставления.Добавить();
		НоваяСтрокаУсловия.УсловиеПредоставления = НовоеУсловие;
	КонецЕсли;
	СкидкаНовая.ДаритьТолькоПолныйКомплект = Ложь;
	СкидкаНовая.ЛюбойПодарокИзСписка = Ложь;
	СкидкаНовая.ПодарокИзКорзиныПокупателя = Ложь;
	
КонецПроцедуры

Функция СоздатьУсловиеДляПодаркаНаВыбор(СкидкаИсточник)
	Условие = Справочники.УсловияПредоставленияСкидокНаценок.СоздатьЭлемент();
	Условие.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаРазовыйОбъемПродаж");
	Условие.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество");
	Условие.ОбластьОграничения = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке");
	Условие.ТипСравнения = ПредопределенноеЗначение("Перечисление.ТипыСравненияЗначенийСкидокНаценок.Больше");
	Условие.ЗначениеУсловияОграничения = 0;
	СписокПодарков = СкидкаИсточник.НаборПодарков.Выгрузить();
	СписокПодарков.Свернуть("Номенклатура, Характеристика");
	Условие.ОтборПродажПоНоменклатуре.Загрузить(СписокПодарков);
	Условие.УчитыватьПродажуТолькоОпределенногоСпискаНоменклатуры = Истина;
	Условие.ВариантПредоставленияСкидкиПоНоменклатуре = ПредопределенноеЗначение("Перечисление.ВариантПредоставленияСкидкиПоНоменклатуре.ПоНоменклатуре");
	Условие.Комментарий = СтрШаблон(НСтр("ru = 'Создано в рамках конвертации настроек скидки-подарка: %1'"), СкидкаИсточник.Ссылка);
	Условие.Наименование = НСтр("ru = 'Товар входит в список подарков'");
    Условие.Записать();
	Возврат Условие.Ссылка; 
КонецФункции

Функция СоздатьУслвоиеЗаКомплект(СкидкаИсточник)
	Условие = Справочники.УсловияПредоставленияСкидокНаценок.СоздатьЭлемент();
	Условие.УсловиеПредоставления = ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок.ЗаКомплектПокупки");
	//Условие.КритерийОграниченияПримененияЗаОбъемПродаж = ПредопределенноеЗначение("Перечисление.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Количество");
	//Условие.ОбластьОграничения = ПредопределенноеЗначение("Перечисление.ВариантыОбластейОграниченияСкидокНаценок.ВДокументе");
	//Условие.ТипСравнения = ПредопределенноеЗначение("Перечисление.ТипыСравненияЗначенийСкидокНаценок.Больше");
	//Условие.ЗначениеУсловияОграничения = 0;
	СписокПодарков = СкидкаИсточник.НаборПодарков.Выгрузить();
	СписокПодарков.Свернуть("Номенклатура, Характеристика, ЕдиницаИзмерения, Количество");
	Условие.КомплектПокупки.Загрузить(СписокПодарков);
	//Условие.УчитыватьПродажуТолькоОпределенногоСпискаНоменклатуры = Истина;
	//Условие.ВариантПредоставленияСкидкиПоНоменклатуре = ПредопределенноеЗначение("Перечисление.ВариантПредоставленияСкидкиПоНоменклатуре.ПоНоменклатуре");
	Условие.Наименование = НСтр("ru = 'За полный комплект подарков'");
	Условие.Комментарий = СтрШаблон(НСтр("ru = 'Создано в рамках конвертации настроек скидки-подарка: %1'"), СкидкаИсточник.Ссылка);
    Условие.Записать();
	Возврат Условие.Ссылка; 
КонецФункции

#КонецОбласти

#КонецОбласти

// Функция - Шаблон процедуры расчета подключаемой скидки
//
// Параметры:
//  ИдентификаторСкидки - Строка - реквизит ИдентификаторДляРасчетаВРасширении справочника автоматических скидок
// 
// Возвращаемое значение:
//  Строка - многострочная строка для формы помощника добавления расширения
//
Функция ШаблонПроцедурыПодключаемойСкидки(ИдентификаторСкидки) Экспорт
	
	// АПК:1299-выкл проектное решение
	ШаблонПроцедуры = 
		НСтр("ru = '
		|// Выполняет произвольный алгоритм расчета скидок, и добавляет сработавшие скидки для каждой строки в таблицу ТаблицаСкидок.
		|// Результат расчета помещает в параметр ТаблицаСкидок.
		|// 
		|// Параметры:
		|//  СтрокаДерева		- см. СкидкиНаценкиСервер.ПолучитьДеревоСкидок - Строка дерева действующих скидок, с учетом групп совместного применения
		|//  ПараметрыРасчета	- см. СкидкиНаценкиСервер.ПодготовитьПараметрыРасчетаСкидок - Параметры текущего документа, необходимые для расчета скидок
		|//  ТаблицаСкидок		- см. СкидкиНаценкиСервер.ПолучитьПустуюТаблицуСкидокСРасшифровкой - Таблица скидок, которые следует применить к документу.
		|//  							Осуществляется возврат изменений параметра в вызывающую функцию.
		|Процедура ЗаполнитьТаблицуСкидок_%1(Знач СтрокаДерева, Знач ПараметрыРасчета, ТаблицаСкидок) Экспорт
		|		
		|	ПараметрыРасчетаСкидки = СкидкиНаценкиСервер.ПолучитьПараметрырасчетаПроизвольнойСкидки(СтрокаДерева, ПараметрыРасчета);
		|	// Таблица сообщений, которые будут показаны кассиру в момент расчета скидки, или пробития чека (только в розничном канале продаж)
		|	ТаблицаСообщений 	= СкидкиНаценкиСервер.ПустаяТаблицаСообщений();
		|	// Таблица подарков, которые следует предоставить покупателю. В данной таблице присутствуют только подарки, которые следует выдать на кассе.
		|	// Подарки, которые покупатель берет самостоятельно (например ""Три по цене двух"") предоставляются в виде скидок, добавлять их в таблицу не нужно.
		|	ТаблицаПодарков 	= СкидкиНаценкиСервер.ПустаяТаблицаПодарков();
		|	Для Каждого Товар Из ПараметрыРасчетаСкидки.Товары Цикл
		|		
		|		// Каждая примененная скидка добаляется в специальную таблицу, связанную с табличной частью товаров 
		|		НоваяСтрока           = ТаблицаСкидок.Добавить();
		|		НоваяСтрока.КлючСвязи = Товар.КлючСвязи;
		|		Если ПараметрыРасчетаСкидки.СтрокиСНевыполненнымиУсловиями.Найти(Товар.КлючСвязи) = Неопределено Тогда
		|			НоваяСтрока.Действует = Истина;
		|		Иначе
		|			// Скидка не применится, но она сохраняется в таблице для отображения в расшифровке расчета
		|			// Тогда можно будет увидеть, какие конкретно условия не выполнились
		|			НоваяСтрока.Действует = Ложь;
		|		КонецЕсли;
		|				
		|		Сумма = Товар.Сумма;
		|
		|#Область ПереопределяемыйАлгоритмРасчетаСуммыСкидки
		|
		|		ЗначениеСкидкиНаценки = ПараметрыРасчетаСкидки.ЗначениеСкидкиНаценки;
		|		СуммаСкидки = Окр((ЗначениеСкидкиНаценки / 100) * Сумма, 2);				
		|
		|#КонецОбласти		
		|
		|		НоваяСтрока.Сумма = СуммаСкидки;
		|		НоваяСтрока.ЗначениеСкидкиНаценки = ЗначениеСкидкиНаценки;
		|		НоваяСтрока.ТаблицаСообщений = ТаблицаСообщений;
		|		НоваяСтрока.ТаблицаПодарков = ТаблицаПодарков;
		|		// Информация для отображения в расшифровке расчета скидок
		|		Комментарий = ""Сумма "" + Сумма + "" * "" + ЗначениеСкидкиНаценки + ""%"";
		|		НоваяСтрока.Расшифровка = СкидкиНаценкиСервер.ПолучитьРасшифровкуСкидки(СтрокаДерева, НоваяСтрока.Сумма, ПараметрыРасчета, Комментарий, ЗначениеСкидкиНаценки);
		|		
		|	КонецЦикла;		
		|КонецПроцедуры
		|'");
	// АПК:1299-вкл
	
	АдаптированныйИдентификатор = СтрЗаменить(ИдентификаторСкидки, "-", "_");
	ШаблонПроцедуры = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПроцедуры, АдаптированныйИдентификатор);
	
	Возврат ШаблонПроцедуры;
	
КонецФункции

#КонецОбласти

#КонецЕсли
